import numpy as np
#################################Model Parameters#######################
dz = 0.5 #m 간격 default : 0.5
Z = 200 #m 몇 m 깊이까지?

dt = 0.01 #년 간격 default : 0.01
Time = 200 #simulation 기간

year_to_sec = 365.2422 * 86400
C_to_K = 273.15
hPa_to_Pa = 1E2
kg_to_g = 1E3
#################################Constants##############################

M_air = 28.96E-3
R = 8.314462
# rho_ice = 0.92054 #?
g = 9.82
P0 = 101325 #Pa

#################위도에 따른 중력가속도 식 (원하면 쓰도록)##################
# latitude = 80

# g_e = 9.7803253359
# k = 0.00193185265241
# e2 = 0.00669437999013
# phi = np.radians(latitude)

# g = g_e * (1 + k * np.sin(phi)**2) / np.sqrt(1 - e2 * np.sin(phi)**2)
########################파일 경로#########################################
ROOT = "E:\\LICP\\code\\CIC\\data\\"